{
  "recipes": [
    {
      "id": 1,
      "foodname": "Spiced Chickpea Stew With Coconut and Turmeric",
      "image": "https://recipes.eerieemu.com/static/recipes/1019772-spiced-chickpea-stew-with-coconut-and-turmeric.jpg",
      "description": "Spiced chickpeas are crisped in olive oil, then simmered in a garlicky coconut milk for an insanely creamy, basically-good-for-you stew that evokes stews found in South India and parts of the Caribbean. While the chickpeas alone would be good as a side dish, they are further simmered with stock, bolstered with dark, leafy greens of your choosing and finished with a handful of fresh mint. When shopping, be sure to avoid low-fat coconut milk, coconut milk meant for drinking or cream of coconut: All are very different and would not be suitable here.",
      "servings": "4 to 6 servings",
      "rating_value": 5,
      "ingredients": [
        "1/4 cup olive oil, plus more for serving",
        "4 garlic cloves, chopped",
        "1 large yellow onion, chopped",
        "1 (2-inch) piece ginger, finely chopped",
        " Kosher salt and black pepper",
        "1 1/2 teaspoons ground turmeric, plus more for serving",
        "1 teaspoon red-pepper flakes, plus more for serving",
        "2 (15-ounce) cans chickpeas, drained and rinsed",
        "2 (15-ounce) cans full-fat coconut milk",
        "2 cups vegetable or chicken stock",
        "1 bunch Swiss chard, kale or collard greens, stems removed, torn into bite-size pieces",
        "1 cup mint leaves, for serving",
        " Yogurt, for serving (optional)",
        " Toasted pita, lavash or other flatbread, for serving (optional)"
      ],
      "instructions": [
        "Heat 1/4 cup oil in a large pot over medium. Add garlic, onion and ginger. Season with salt and pepper, and cook, stirring occasionally until onion is translucent and starts to brown a little at the edges, 3 to 5 minutes.",
        "Add 1 1/2 teaspoons turmeric, 1 teaspoon red-pepper flakes, and the chickpeas, and season with salt and pepper. Cook, stirring frequently, so the chickpeas sizzle and fry a bit in the spices and oil, until they’ve started to break down and get a little browned and crisp, 8 to 10 minutes. Remove about a cup of chickpeas and set aside for garnish.",
        "Using a wooden spoon or spatula, further crush the remaining chickpeas slightly to release their starchy insides. (This will help thicken the stew.) Add coconut milk and stock, and season with salt and pepper.",
        "Bring to a simmer, scraping up any bits that have formed on the bottom of the pot. Cook, stirring occasionally, until stew has thickened, 30 to 35 minutes. (Taste a chickpea or two, not just the liquid, to make sure they have simmered long enough to be as delicious as possible.) If after 30 to 35 minutes, you want the stew a bit thicker, keep simmering until you've reached your desired consistency. Determining perfect stew thickness is a personal journey!",
        "Add greens and stir, making sure they’re submerged in the liquid. Cook until they wilt and soften, 3 to 7 minutes, depending on what you’re using. (Swiss chard and spinach will wilt and soften much faster than kale or collard greens.) Season again with salt and pepper.",
        "Divide among bowls and top with mint, reserved chickpeas, a sprinkle of red-pepper flakes and a good drizzle of olive oil. Serve alongside yogurt and toasted pita if using; dust the yogurt with turmeric if you'd like."
      ],
      "country": "Cocos (Keeling) Islands"
    },
    {
      "id": 4,
      "foodname": "No-Knead Bread",
      "image": "https://recipes.eerieemu.com/static/recipes/11376-no-knead-bread.jpg",
      "description": "Here is one of the most popular recipes The Times has ever published, courtesy of Jim Lahey, owner of Sullivan Street Bakery. It requires no kneading. It uses no special ingredients, equipment or techniques. And it takes very little effort — only time. You will need 24 hours to create the bread, but much of this is unattended waiting, a slow fermentation of the dough that results in a perfect loaf. (We've updated the recipe to reflect <a href=\"https://www.nytimes.com/2006/12/06/dining/06mini.html\">changes Mark Bittman made</a> to the recipe in 2006 after publishing and receiving reader feedback. The original recipe called for 3 cups flour; we've adjusted it to call for 3 1/3 cups/430 grams flour.)",
      "servings": "One 1 1/2-pound loaf",
      "rating_value": 5,
      "ingredients": [
        "3 1/3 cups/430 grams all-purpose or bread flour, plus more for dusting",
        " Generous 1/4 teaspoon/1 gram instant yeast",
        "2 teaspoons/8 grams kosher salt",
        " Cornmeal or wheat bran, as needed"
      ],
      "instructions": [
        "In a large bowl combine flour, yeast and salt. Add 1 1/2 cups/345 grams water and stir until blended; dough will be shaggy and sticky. Cover bowl with plastic wrap. Let dough rest at least 12 hours, preferably about 18, at warm room temperature, about 70 degrees.",
        "Dough is ready when its surface is dotted with bubbles. Lightly flour a work surface and place dough on it; sprinkle it with a little more flour and fold it over on itself once or twice. Cover loosely with plastic wrap and let rest about 15 minutes.",
        "Using just enough flour to keep dough from sticking to work surface or to your fingers, gently and quickly shape dough into a ball. Generously coat a cotton towel (not terry cloth) with flour, wheat bran or cornmeal; put dough seam side down on towel and dust with more flour, bran or cornmeal. Cover with another cotton towel and let rise for about 2 hours. When it is ready, dough will be more than double in size and will not readily spring back when poked with a finger.",
        "At least a half-hour before dough is ready, heat oven to 450 degrees. Put a 6- to 8-quart heavy covered pot (cast iron, enamel, Pyrex or ceramic) in oven as it heats. When dough is ready, carefully remove pot from oven. Slide your hand under towel and turn dough over into pot, seam side up; it may look like a mess, but that is O.K. Shake pan once or twice if dough is unevenly distributed; it will straighten out as it bakes. Cover with lid and bake 30 minutes, then remove lid and bake another 15 to 30 minutes, until loaf is beautifully browned. Cool on a rack."
      ],
      "country": "Dominican Republic"
    },
    {
      "id": 5,
      "foodname": "Marcella Hazan’s Bolognese Sauce",
      "image": "https://recipes.eerieemu.com/static/recipes/1015181-marcella-hazans-bolognese-sauce.jpg",
      "description": "After the death in 2013 of Marcella Hazan, the cookbook who changed the way Americans cook Italian food, The Times asked readers which of her recipes had become staples in their kitchens. Many people answered with one word: “Bolognese.” Ms. Hazan had a few recipes for the classic sauce, and they are all outstanding. This one appeared in her book “The Essentials of Classic Italian Cuisine,” and one reader called it “the gold standard.” Try it and see for yourself.",
      "servings": "2 heaping cups, for about 6 servings and 1 1/2 pounds pasta",
      "rating_value": 5,
      "ingredients": [
        "1 tablespoon vegetable oil",
        "3 tablespoons butter plus 1 tablespoon for tossing the pasta",
        "1/2 cup chopped onion",
        "2/3 cup chopped celery",
        "2/3 cup chopped carrot",
        "3/4 pound ground beef chuck (or you can use 1 part pork to 2 parts beef)",
        " Salt",
        " Black pepper, ground fresh from the mill",
        "1 cup whole milk",
        " Whole nutmeg",
        "1 cup dry white wine",
        "1 1/2 cups canned imported Italian plum tomatoes, cut up, with their juice",
        "1 1/4 to 1 1/2 pounds pasta",
        " Freshly grated parmigiano-reggiano cheese at the table"
      ],
      "instructions": [
        "Put the oil, butter and chopped onion in the pot and turn the heat on to medium. Cook and stir the onion until it has become translucent, then add the chopped celery and carrot. Cook for about 2 minutes, stirring vegetables to coat them well.",
        "Add ground beef, a large pinch of salt and a few grindings of pepper. Crumble the meat with a fork, stir well and cook until the beef has lost its raw, red color.",
        "Add milk and let it simmer gently, stirring frequently, until it has bubbled away completely. Add a tiny grating -- about 1/8 teaspoon -- of nutmeg, and stir.",
        "Add the wine, let it simmer until it has evaporated, then add the tomatoes and stir thoroughly to coat all ingredients well. When the tomatoes begin to bubble, turn the heat down so that the sauce cooks at the laziest of simmers, with just an intermittent bubble breaking through to the surface. Cook, uncovered, for 3 hours or more, stirring from time to time. While the sauce is cooking, you are likely to find that it begins to dry out and the fat separates from the meat. To keep it from sticking, add 1/2 cup of water whenever necessary. At the end, however, no water at all must be left and the fat must separate from the sauce. Taste and correct for salt.",
        "Toss with cooked drained pasta, adding the tablespoon of butter, and serve with freshly grated Parmesan on the side."
      ],
      "country": "Saint Martin"
    },
    {
      "id": 7,
      "foodname": "Oven-Roasted Chicken Shawarma",
      "image": "https://recipes.eerieemu.com/static/recipes/1017161-oven-roasted-chicken-shawarma.jpg",
      "description": "Here is a recipe for an oven-roasted version of the classic street-side flavor bomb usually cooked on a rotisserie. It is perfect for an evening with family and friends. Serve with pita and tahini, chopped cucumbers and tomatoes, some olives, chopped parsley, some feta, fried eggplant, hummus swirled with harissa, rice or rice pilaf. You can make the white sauce that traditionally accompanies it by cutting plain yogurt with mayonnaise and lemon juice, and flecking it with garlic. For a red to offset it, simmer ketchup with red pepper flakes and a hit of red-wine vinegar until it goes syrupy and thick, or just use your favorite hot sauce instead.",
      "servings": "4 to 6 servings",
      "rating_value": 5,
      "ingredients": [
        "2 lemons, juiced",
        "1/2 cup plus 1 tablespoon olive oil",
        "6 cloves garlic, peeled, smashed and minced",
        "1 teaspoon kosher salt",
        "2 teaspoons freshly ground black pepper",
        "2 teaspoons ground cumin",
        "2 teaspoons paprika",
        "1/2 teaspoon turmeric",
        " A pinch ground cinnamon",
        " Red pepper flakes, to taste",
        "2 pounds boneless, skinless chicken thighs",
        "1 large red onion, peeled and quartered",
        "2 tablespoons chopped fresh parsley"
      ],
      "instructions": [
        "Prepare a marinade for the chicken. Combine the lemon juice, 1/2 cup olive oil, garlic, salt, pepper, cumin, paprika, turmeric, cinnamon and red pepper flakes in a large bowl, then whisk to combine. Add the chicken and toss well to coat. Cover and store in refrigerator for at least 1 hour and up to 12 hours.",
        "When ready to cook, heat oven to 425 degrees. Use the remaining tablespoon of olive oil to grease a rimmed sheet pan. Add the quartered onion to the chicken and marinade, and toss once to combine. Remove the chicken and onion from the marinade, and place on the pan, spreading everything evenly across it.",
        "Put the chicken in the oven and roast until it is browned, crisp at the edges and cooked through, about 30 to 40 minutes. Remove from the oven, allow to rest 2 minutes, then slice into bits. (To make the chicken even more crisp, set a large pan over high heat, add a tablespoon of olive oil to the pan, then the sliced chicken, and sauté until everything curls tight in the heat.) Scatter the parsley over the top and serve with tomatoes, cucumbers, pita, white sauce, hot sauce, olives, fried eggplant, feta, rice — really anything you desire."
      ],
      "country": "Papua New Guinea"
    },
    {
      "id": 8,
      "foodname": "Creamy Macaroni and Cheese",
      "image": "https://recipes.eerieemu.com/static/recipes/1015825-creamy-macaroni-and-cheese.jpg",
      "description": "There are two schools of thought about macaroni and cheese: Some like it crusty and extra-cheesy here’s our recipe</a>), while others prefer it smooth and creamy. But most people are delighted by any homemade macaroni and cheese. It is light years ahead of the boxed versions. This creamy version has one powerful advantage for the cook: There’s no need to preboil the pasta. It cooks in the oven, absorbing the liquid from the dairy products",
      "servings": "6 to 8 servings",
      "rating_value": 5,
      "ingredients": [
        "2 tablespoons unsalted butter",
        "1 cup cottage cheese (not low-fat)",
        "2 cups milk (not skim)",
        "1 teaspoon dry mustard",
        " Pinch of ground cayenne",
        " Pinch of ground nutmeg",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon black pepper",
        "1 pound sharp or extra-sharp Cheddar, grated",
        "1/2 pound elbow pasta, uncooked"
      ],
      "instructions": [
        "Heat oven to 375 degrees and position an oven rack in upper third of oven. Use 1 tablespoon butter to grease a 9-inch round or square baking pan.",
        "In a blender, purée cottage cheese, milk, mustard, cayenne, nutmeg and salt and pepper. Reserve 1/4 cup grated Cheddar for topping. In a large bowl, combine remaining grated Cheddar, milk mixture and uncooked pasta. Pour into prepared pan, cover tightly with foil and bake 30 minutes.",
        "Uncover pan, stir gently, sprinkle with reserved cheese and dot with remaining tablespoon butter. Bake, uncovered, 30 minutes more, until browned. Let cool at least 15 minutes before serving."
      ],
      "country": "Gibraltar"
    },
    {
      "id": 9,
      "foodname": "Roberta’s Pizza Dough",
      "image": "https://recipes.eerieemu.com/static/recipes/1016230-robertas-pizza-dough.jpg",
      "description": "This recipe, adapted from Roberta’s, the pizza and hipster haute-cuisine utopia in Bushwick, Brooklyn, provides a delicate, extraordinarily flavorful dough that will last in the refrigerator for up to a week. It rewards close attention to weight rather than volume in the matter of the ingredients, and asks for a mixture of finely ground Italian pizza flour (designated “00” on the bags and available in some supermarkets, many specialty groceries and always online) and regular all-purpose flour. As ever with breads, rise time will depend on the temperature and humidity of your kitchen and refrigerator.\n\n Our Greatest Pizza Recipes",
      "servings": "Two 12-inch pizzas",
      "rating_value": 5,
      "ingredients": [
        "153 grams 00 flour (1 cup plus 1 tablespoon)",
        "153 grams all-purpose flour (1 cup plus 1 tablespoon and 2 teaspoons)",
        "8 grams fine sea salt (1 teaspoon)",
        "2 grams active dry yeast (3/4 teaspoon)",
        "4 grams extra-virgin olive oil (1 teaspoon)"
      ],
      "instructions": [
        "In a large mixing bowl, combine flours and salt.",
        "In a small mixing bowl, stir together 200 grams (a little less than 1 cup) lukewarm tap water, the yeast and the olive oil, then pour it into flour mixture. Knead with your hands until well combined, approximately 3 minutes, then let the mixture rest for 15 minutes.",
        "Knead rested dough for 3 minutes. Cut into 2 equal pieces and shape each into a ball. Place on a heavily floured surface, cover with dampened cloth, and let rest and rise for 3 to 4 hours at room temperature or for 8 to 24 hours in the refrigerator. (If you refrigerate the dough, remove it 30 to 45 minutes before you begin to shape it for pizza.)",
        "To make pizza, place each dough ball on a heavily floured surface and use your fingers to stretch it, then your hands to shape it into rounds or squares. Top and bake."
      ],
      "country": "Uganda"
    },
    {
      "id": 10,
      "foodname": "Chocolate Chip Cookies",
      "image": "https://recipes.eerieemu.com/static/recipes/1015819-chocolate-chip-cookies.jpg",
      "description": "You may have memorized the foolproof gem on the back of the Toll House bag, given to the world Graves Wakefield in the 1930s. But this may become your new favorite chocolate chip cookie recipe. It’s a little more complicated, and you’ll have to plan ahead: After assembling the dough, you must chill it for at least 24 hours before baking it, and preferably up to 36. This allows the dry ingredients time to soak up the wet ones, which results in a firmer dough. It leads to a marvelously chewy, chocolate-rich cookie. Don’t skimp on good chocolate, and the sea salt is not an option — it’s the beacon at the top of this gorgeous treat. (You can certainly put this recipe together by hand, but a stand mixer makes it easy work. If you’re in the market for one, our colleagues at The Wirecutter have tested quite a few, and they've put together",
      "servings": "1 1/2 dozen 5-inch cookies",
      "rating_value": 5,
      "ingredients": [
        "2 cups minus 2 tablespoons cake flour (8 1/2 ounces)",
        "1 2/3 cups bread flour (8 1/2 ounces)",
        "1 1/4 teaspoons baking soda",
        "1 1/2 teaspoons baking powder",
        "1 1/2 teaspoons coarse salt",
        "1 1/4 cups unsalted butter (2 1/2 sticks)",
        "1 1/4 cups light brown sugar (10 ounces)",
        "1 cup plus 2 tablespoons granulated sugar (8 ounces)",
        "2 large eggs",
        "2 teaspoons natural vanilla extract",
        "1 1/4 pounds bittersweet chocolate disks or fèves, at least 60 percent cacao content (see note)",
        " Sea salt"
      ],
      "instructions": [
        "Sift flours, baking soda, baking powder and salt into a bowl. Set aside.",
        "Using a <a href='https://www.nytimes.com/wirecutter/reviews/best-stand-mixer/'>mixer</a> fitted with paddle attachment, cream butter and sugars together until very light, about 5 minutes. Add eggs, one at a time, mixing well after each addition. Stir in the vanilla. Reduce speed to low, add dry ingredients and mix until just combined, 5 to 10 seconds. Drop chocolate pieces in and incorporate them without breaking them. Press plastic wrap against dough and refrigerate for 24 to 36 hours. Dough may be used in batches, and can be refrigerated for up to 72 hours.",
        "When ready to bake, preheat oven to 350 degrees. Line a baking sheet with parchment paper or a nonstick baking mat. Set aside.",
        "Scoop 6 3 1/2-ounce mounds of dough (the size of generous golf balls) onto baking sheet, making sure to turn horizontally any chocolate pieces that are poking up; it will make for a more attractive cookie. Sprinkle lightly with sea salt and bake until golden brown but still soft, 18 to 20 minutes. Transfer sheet to a wire rack for 10 minutes, then slip cookies onto another rack to cool a bit more. Repeat with remaining dough, or reserve dough, refrigerated, for baking remaining batches the next day. Eat warm, with a big napkin."
      ],
      "country": "Venezuela"
    },
    {
      "id": 11,
      "foodname": "Shakshuka With Feta",
      "image": "https://recipes.eerieemu.com/static/recipes/1014721-shakshuka-with-feta.jpg",
      "description": "Shakshuka may be at the apex of eggs-for-dinner recipes, though in Israel it is breakfast food, a bright, spicy start to the day with a pile of pita or challah served on the side. (It also makes excellent brunch or lunch food.) It’s a one-skillet recipe of eggs baked in a tomato-red pepper sauce spiced with cumin, paprika and cayenne. First you make that sauce, which comes together fairly quickly on top of the stove, then you gently crack each of the eggs into the pan, nestling them into the sauce. The pan is moved into the oven to finish. Shakshuka originated in North Africa, and like many great dishes there are as many versions as there are cooks who have embraced it. This one strays from more traditional renditions by adding crumbled feta cheese, which softens into creamy nuggets in the oven’s heat.",
      "servings": "4 to 6 servings",
      "rating_value": 5,
      "ingredients": [
        "3 tablespoons extra-virgin olive oil",
        "1 large onion, halved and thinly sliced",
        "1 large red bell pepper, seeded and thinly sliced",
        "3 garlic cloves, thinly sliced",
        "1 teaspoon ground cumin",
        "1 teaspoon sweet paprika",
        "1/8 teaspoon ground cayenne, or to taste",
        "1 (28-ounce) can whole plum tomatoes with their juices, coarsely chopped",
        "3/4 teaspoon kosher salt, plus more as needed",
        "1/4 teaspoon black pepper, plus more as needed",
        "5 ounces feta, crumbled (about 1 1/4 cups)",
        "6 large eggs",
        " Chopped cilantro, for serving",
        " Hot sauce, for serving"
      ],
      "instructions": [
        "Heat oven to 375 degrees. Heat oil in a large skillet over medium-low. Add onion and bell pepper. Cook gently until very soft, about 20 minutes. Add garlic and cook until tender, 1 to 2 minutes; stir in cumin, paprika and cayenne, and cook 1 minute. Pour in tomatoes and season with 3/4 teaspoon salt and 1/4 teaspoon pepper; simmer until tomatoes have thickened, about 10 minutes. Taste and add more salt and pepper if needed. Stir in crumbled feta.",
        "Gently crack eggs into skillet over tomatoes. Season eggs with salt and pepper. Transfer skillet to oven and bake until eggs are just set, 7 to 10 minutes. Sprinkle with cilantro and serve with hot sauce."
      ],
      "country": "Solomon Islands"
    },
    {
      "id": 12,
      "foodname": "Buttermilk-Brined Roast Chicken",
      "slug": "1018731-buttermilk-brined-roast-chicken",
      "image": "https://recipes.eerieemu.com/static/recipes/1018731-buttermilk-brined-roast-chicken.jpg",
      "description": "This recipe, adapted from Samin Nosrat's \"Salt Fat Acid Heat,\" is inspired by the Southern grandma method of marinating chicken overnight in buttermilk before frying it. You're roasting here, but the buttermilk and salt still work like a brine, tenderizing the meat on multiple levels to yield an unbelievably juicy chicken. As an added bonus, the sugars in the buttermilk will caramelize, contributing to an exquisitely browned skin. Be sure to leave 24 hours for marinating the chicken. While the beauty of roast chicken is that you can serve it anytime, anywhere, try serving it alongside panzanella, which plays the role of starch, salad and sauce.",
      "servings": "4 servings",
      "rating_value": 5,
      "ingredients": [
        "1 chicken, 3 1/2 to 4 pounds",
        " Kosher salt or fine sea salt",
        "2 cups buttermilk"
      ],
      "instructions": [
        "The day before you want to cook the chicken, remove the wingtips by cutting through the first wing joint with poultry shears or a sharp knife. Reserve for stock. Season chicken generously with salt and let it sit for 30 minutes.",
        "Stir 2 tablespoons kosher salt or 4 teaspoons fine sea salt into the buttermilk to dissolve. Place the chicken in a gallon-size resealable plastic bag and pour in the buttermilk. (If the chicken won’t fit in a gallon-size bag, double up 2 plastic produce bags to prevent leaks and tie the bag with twine.)",
        "Seal the bag, squish the buttermilk all around the chicken, place on a rimmed plate, and refrigerate for 12 to 24 hours. If you’re so inclined, you can turn the bag periodically so every part of the chicken gets marinated, but that’s not essential.",
        "Pull the chicken from the fridge an hour before you plan to cook it. Heat the oven to 425 degrees with a rack set in the center position.",
        "Remove the chicken from the plastic bag and scrape off as much buttermilk as you can without being obsessive. Tightly tie together the legs with a piece of butcher’s twine. Place the chicken in a 10-inch cast-iron skillet or a shallow roasting pan.",
        "Slide the pan all the way to the back of the oven on the center rack. Rotate the pan so that the legs are pointing toward the rear left corner and the breast is pointing toward the center of the oven. (The back corners tend to be the hottest spots in the oven, so this orientation protects the breast from overcooking before the legs are done.) Pretty quickly you should hear the chicken sizzling.",
        "After about 20 minutes, when the chicken starts to brown, reduce the heat to 400 degrees and continue roasting for 10 minutes.",
        "Move the pan so the legs are facing the rear right corner of the oven. Continue cooking for another 30 minutes or so, until the chicken is brown all over and the juices run clear when you insert a knife down to the bone between the leg and the thigh. If the skin is getting too brown before it is cooked through, use a foil tent. Remove it to a platter and let it rest for 10 minutes before carving and serving."
      ],
      "country": "Singapore"
    },
    {
      "id": 13,
      "foodname": "Buttery Breakfast Casserole",
      "slug": "1017894-buttery-breakfast-casserole",
      "image": "https://recipes.eerieemu.com/static/recipes/1017894-buttery-breakfast-casserole.jpg",
      "description": "The word “buttery” in the title refers to croissants, which make an especially rich foundation for this golden-topped baked breakfast classic. Toasting the croissants before building the casserole adds caramelized notes that can stand up to the bits of browned sausage, sage and melted Gruyère strewn throughout. Make this the night before a special breakfast or brunch, then pop it in the oven an hour before you plan to serve it.",
      "servings": "8 to 10 servings",
      "rating_value": 5,
      "ingredients": [
        "@@ @@",
        "1 pound croissants (about 5 to 7), split in half lengthwise",
        "1 tablespoon extra-virgin olive oil, more for baking dish",
        "1 bunch scallions (6 to 7), white and light green parts thinly sliced, greens reserved",
        "3/4 pound sweet Italian sausage, casings removed",
        "2 teaspoons finely chopped fresh sage",
        "8 large eggs",
        "3 cups whole milk",
        "1 cup heavy cream",
        "8 ounces Gruyère, grated (2 cups)",
        "1 1/4 teaspoons kosher salt",
        "1 teaspoon black pepper"
      ],
      "instructions": [
        "Heat oven to 500 degrees. Spread croissants on a large baking sheet and toast, cut side up, until golden brown, 5 to 10 minutes (watch carefully to see that they do not burn). Let cool, then tear into large bite-size pieces.",
        "In a medium skillet over medium-high heat, warm the olive oil. Add sliced scallions and sausage meat; cook, breaking up meat with a fork, until mixture is well browned, about 5 minutes. Stir in sage, and remove from heat.",
        "In a large bowl, toss together croissants and sausage mixture. In a separate bowl, whisk together eggs, milk, cream, 1 1/2 cups cheese, salt and pepper.",
        "Lightly oil a 9- x 13-inch baking dish. Turn croissant mixture into pan, spreading it out evenly over the bottom. Pour custard into pan, pressing croissants down gently to help absorb the liquid. Cover pan with plastic wrap and refrigerate at least 4 hours or overnight.",
        "When you’re ready to bake the casserole, heat oven to 350 degrees. Scatter the remaining grated cheese over the top of the casserole. Transfer to oven and bake until casserole is golden brown and firm to the touch, 45 minutes. Let stand 10 minutes. Garnish with sliced scallion tops before serving."
      ],
      "country": "Maldives"
    },
    {
      "id": 14,
      "foodname": "Cranberry Curd Tart",
      "slug": "1017817-cranberry-curd-tart",
      "image": "https://recipes.eerieemu.com/static/recipes/1017817-cranberry-curd-tart.jpg",
      "description": "If you are a fan of lemon curd or the classic French tarte au citron, you will love this cranberry version. To minimize kitchen time, make it in stages, preparing the crust and curd a day or two in advance. The finished tart keeps well for a couple of days too. The wheat-free hazelnut crust is adapted from a cookie recipe from the pastry chef and writer <a href=\"http://www.davidlebovitz.com/\">David Lebovitz’s popular website</a>.",
      "servings": "8 to 10 servings",
      "rating_value": 5,
      "ingredients": [
        "@@FOR THE HAZELNUT CRUST:@@",
        "1 1/4 cups/180 grams raw hazelnuts",
        "1 cup/125 grams rice flour",
        "1/4 teaspoon salt",
        "1/2 cup/112 grams sugar",
        "6 tablespoons/100 grams softened butter, more as necessary",
        "@@FOR THE CRANBERRY CURD:@@",
        "12 ounces/340 grams cranberries",
        "1 cup/225 grams sugar",
        " Peel (orange part only) and juice of 1 orange (about 1/2 cup)",
        "4 ounces/113 grams softened butter (1 stick)",
        "2 eggs plus 2 egg yolks"
      ],
      "instructions": [
        "Make the crust: Heat oven to 325 degrees. Put hazelnuts on a baking sheet and roast for 10 to 15 minutes, until skins darken and crack. Put roasted nuts in a clean towel and rub off skins. Discard skins and let nuts cool.",
        "In a food processor, grind nuts with half the rice flour until mixture resembles coarse cornmeal. Add remaining rice flour and salt and pulse briefly.",
        "Cream sugar and butter in a mixing bowl with a wooden spoon for a minute or two until pale and thick. Add nut mixture and combine until dough comes together. If it seems crumbly, add 1 to 2 tablespoons softened butter or a little cold water.",
        "Press dough evenly into a 10-inch tart pan; use half the dough for the sides and half for the bottom. Prick bottom with a fork and freeze for 30 minutes (or several days if desired).",
        "Heat oven to 350 degrees. Bake chilled tart shell about 15 minutes until lightly brown. Cool.",
        "While the crust bakes and cools, make the cranberry curd: Put cranberries, sugar and orange juice and peel in a saucepan over medium heat. Simmer until cranberries have popped and softened, about 10 minutes. Transfer to a food mill or medium mesh sieve and press cooking liquid and solids into a bowl. (Alternatively, for the most vibrant color, purée the cooked cranberry and orange mixture with an immersion blender or in a food processor or blender. Press through a fine-mesh sieve.) Whisk the butter into the warm liquid.",
        "Put eggs and egg yolks into a bowl and beat lightly. Slowly whisk a cup of warm cranberry liquid into the eggs to temper, then combine both and whisk together. Wipe out pot if necessary, return liquid to pot and cook over low heat until nearly bubbling and thickened, about 10 minutes. If using immediately, let cool to room temperature. If working ahead, cool to room temperature, cover with plastic wrap (press wrap against curd) and refrigerate. (Curd may be cooked up to 1 day ahead.)",
        "Pour cooled cranberry curd into the cooled prebaked tart shell and smooth top with a spatula. Bake at 350 degrees for 10 minutes to set curd. Cool on a rack. Store at room temperature for up to 2 days."
      ],
      "country": "Falkland Islands (Malvinas)"
    },
    {
      "id": 15,
      "foodname": "One-Pan Orzo With Spinach and Feta",
      "slug": "1021485-one-pan-orzo-with-spinach-and-feta",
      "image": "https://recipes.eerieemu.com/static/recipes/1021485-one-pan-orzo-with-spinach-and-feta.jpg",
      "description": "Similar to spanakorizo, a Greek spinach and rice dish, this easy, meatless meal features orzo, spinach, peas and scallions. It is deeply satisfying but still on the lighter side of pasta recipes, thanks to all those vegetables. A little feta gives it creaminess and tang, while some lemon zest brightens everything up. It makes a complete meal on its own, or, if you’re looking for something more substantial, serve this as a hearty side dish to roasted meats or fish.",
      "servings": "4 servings",
      "rating_value": 5,
      "ingredients": [
        "2 tablespoons unsalted butter",
        "4 large scallions, trimmed and thinly sliced",
        "2 large garlic cloves, minced",
        "8 ounces baby spinach leaves (8 cups), coarsely chopped",
        "1 teaspoon kosher salt",
        "1 3/4 cups low-sodium chicken or vegetable stock",
        "1 cup orzo",
        "1 teaspoon finely grated lemon zest (from 1 lemon)",
        "3/4 cup crumbled feta (3 ounces), plus more for garnish",
        "1/2 cup frozen peas, thawed (optional)",
        "1 cup chopped fresh dill, or use parsley or cilantro"
      ],
      "instructions": [
        "Heat a 10-inch skillet over medium, then melt butter, 30 seconds to 1 minute. Stir in about three-quarters of the scallions (saving some of the green parts for garnish) and garlic, and cook until softened, stirring frequently, about 3 minutes.",
        "Stir in spinach, adding in batches if it doesn’t all fit in the pan at once, and 1/2 teaspoon salt. Continue to cook, stirring occasionally, until spinach is wilted, about 5 minutes.",
        "Stir in stock and bring to a simmer. Stir in orzo, lemon zest and remaining 1/2 teaspoon salt. Cover and simmer over medium-low heat until orzo is nearly cooked through and most of the liquid is absorbed, 10 to 14 minutes, stirring once or twice.",
        "Stir in cheese, peas (if you like) and dill, cover the pan, and cook for another 1 minute, to finish cooking and warm the peas. To serve, sprinkle with more cheese and the reserved scallions."
      ],
      "country": "Faroe Islands"
    },
    {
      "id": 16,
      "foodname": "Three-Cup Chicken",
      "slug": "1017456-three-cup-chicken",
      "image": "https://recipes.eerieemu.com/static/recipes/1017456-three-cup-chicken.jpg",
      "description": "Ask 30 people how to make this simple Taiwanese recipe, and you’ll receive 30 different responses. Some fry the chicken before braising it, use more oil, less wine, different blends of soy sauce. Debates rage over how thick the sauce should be, over which parts of the chicken to use. (Few follow the folk recipe that calls for making the sauce with a cup each of sesame oil, soy sauce and rice wine. “If you actually cook it that way,” says Eddie Huang, the Taiwanese-American chef who inspired the television program “Fresh Off the Boat,” “you’ll be in trouble.”) Our reporting and testing led us to the recipe below. Use it as a starting point, and then make it your own.",
      "servings": "4 servings",
      "rating_value": 5,
      "ingredients": [
        "3 tablespoons sesame oil",
        "1 2-to-3-inch piece of ginger, peeled and sliced into coins, approximately 12",
        "12 cloves of garlic, peeled",
        "4 whole scallions, trimmed and cut into 1-inch pieces",
        "3 dried red peppers or 1 teaspoon red-pepper flakes",
        "2 pounds chicken thighs, boneless or bone-in, cut into bite-size pieces",
        "1 tablespoon unrefined or light brown sugar",
        "1/2 cup rice wine",
        "1/4 cup light soy sauce",
        "2 cups fresh Thai basil leaves or regular basil leaves"
      ],
      "instructions": [
        "Heat a wok over high heat and add 2 tablespoons sesame oil. When the oil shimmers, add the ginger, garlic, scallions and peppers, and cook until fragrant, approximately 2 minutes.",
        "Scrape the aromatics to the sides of the wok, add remaining oil and allow to heat through. Add the chicken, and cook, stirring occasionally, until it is browned and crisping at the edges, approximately 5 to 7 minutes.",
        "Add sugar and stir to combine, then add the rice wine and soy sauce, and bring just to a boil. Lower the heat, then simmer until the sauce has reduced and started to thicken, approximately 15 minutes.",
        "Turn off the heat, add the basil and stir to combine. Serve with white rice."
      ],
      "country": "San Marino"
    },
    {
      "id": 17,
      "foodname": "Lemony White Bean Soup With Turkey and Greens",
      "slug": "1021776-lemony-white-bean-soup-with-turkey-and-greens",
      "image": "https://recipes.eerieemu.com/static/recipes/1021776-lemony-white-bean-soup-with-turkey-and-greens.jpg",
      "description": "Bright with lemon and herbs, and packed with hearty greens, this highly adaptable soup can be either light and brothy or thick and stewlike, depending on your preference. Smashing some of the beans to release their starch will give you a thicker soup that’s almost worthy of a fork. To keep it on the brothy side, add a little more liquid and leave the beans intact. Either way, it’s a warming, piquant, one-pot meal that’s perfect for winter.",
      "servings": "4 servings",
      "rating_value": 5,
      "ingredients": [
        "3 tablespoons olive oil",
        "1 large onion, diced",
        "1 large carrot, diced",
        "1 bunch sturdy greens, such as kale, broccoli rabe, mustard greens or collard greens",
        "1 tablespoon tomato paste",
        "3/4 teaspoon ground cumin, plus more to taste",
        "1/8 teaspoon red-pepper flakes, plus more to taste",
        "1/2 pound ground turkey",
        "3 garlic cloves, minced",
        "1 tablespoon finely grated fresh ginger",
        "1 teaspoon kosher salt, plus more to taste",
        "1 quart chicken stock",
        "2 (15-ounce) cans white beans, drained and rinsed",
        "1 cup chopped fresh, soft herbs, such as parsley, mint, dill, basil, tarragon, chives or a combination",
        " Fresh lemon juice, to taste"
      ],
      "instructions": [
        "Heat a large pot over medium-high for a minute or so to warm it up. Add the oil and heat until it thins out, about 30 seconds. Add onion and carrot, and sauté until very soft and brown at the edges, 7 to 10 minutes.",
        "Meanwhile, rinse the greens and pull the leaves off the stems. Tear or chop into bite-size pieces and set aside.",
        "When the onion is golden, add tomato paste, 3/4 teaspoon cumin and 1/8 teaspoon red-pepper flakes to the pot, and sauté until paste darkens, about 1 minute. Add turkey, garlic, ginger and 1 teaspoon salt, and sauté, breaking up the meat with your spoon, until turkey is browned in spots, 4 to 7 minutes.",
        "Add stock and beans, and bring to a simmer. Let simmer until the soup is thick and flavorful, adding more salt if needed, 15 to 25 minutes. If you like a thicker broth, you can smash some of the beans with the back of the spoon to release their starch. Or leave the beans whole for a brothier soup.",
        "Add the greens to the pot and simmer until they are very soft. This will take 5 to 10 minutes for most greens, but tough collard greens might take 15 minutes. (Add a little water if the broth gets too reduced.)",
        "Stir herbs and lemon juice into the pot, taste and add more salt, cumin and lemon until the broth is lively and bright-tasting. Serve topped with a drizzle of olive oil and more red-pepper flakes, if desired."
      ],
      "country": "American Samoa"
    },
    {
      "id": 19,
      "foodname": "Basic Pesto",
      "slug": "2653-basic-pesto",
      "image": "https://recipes.eerieemu.com/static/recipes/2653-basic-pesto.jpg",
      "description": "Pesto is a mouthful of bright summer — basil made more so.  You can buy it in a jar or in the refrigerator section of your grocery store, but there is nothing better than making it yourself. Fresh basil can be found in abundance at farmers’ markets in the summer. Just clean, take the stems off and throw the leaves in a food processor with nuts and garlic. Dribble in the oil and you’ve got a versatile sauce for pasta, chicken or fish.",
      "servings": "2 cups",
      "rating_value": 5,
      "ingredients": [
        "2 cups fresh basil leaves (no stems)",
        "2 tablespoons pine nuts or walnuts",
        "2 large cloves garlic",
        "1/2 cup extra-virgin olive oil",
        "1/2 cup freshly grated parmesan cheese"
      ],
      "instructions": [
        "Combine basil leaves, pine nuts or walnuts and garlic in a food processor and process until very finely minced.",
        "With the machine running slowly dribble in the oil and process until the mixture is smooth.",
        "Add the cheese and process very briefly, just long enough to combine. Store in refrigerator or freezer."
      ],
      "country": "Congo"
    },
    {
      "id": 20,
      "foodname": "Creamy Cauliflower Soup With Rosemary Olive Oil",
      "slug": "1020764-creamy-cauliflower-soup-with-rosemary-olive-oil",
      "image": "https://recipes.eerieemu.com/static/recipes/1020764-creamy-cauliflower-soup-with-rosemary-olive-oil.jpg",
      "description": "This soup turns a short list of vegan ingredients into a sublimely silky soup. Infusing olive oil with fresh rosemary is a trick you’ll want to keep up your sleeve: The results are delicious brushed on roast chicken, drizzled over roasted winter vegetables or even just sopped up with a nice piece of bread. The croutons here are optional, but they transform an elegant and delicate first-course soup into a satisfying lunch.",
      "servings": "6 servings",
      "rating_value": 5,
      "ingredients": [
        "@@FOR THE ROSEMARY OIL:@@",
        "1 cup olive oil",
        "4 (4-inch) sprigs fresh rosemary",
        "@@FOR THE SOUP:@@",
        "2 tablespoons olive oil",
        "1 medium yellow onion, chopped (about 1 cup)",
        "2 garlic cloves, minced (about 1 tablespoon)",
        "1 quart low-sodium vegetable stock, plus more as needed for reheating",
        "1 medium head cauliflower, cored and broken into 1 1/2-inch florets (about 2 1/2 pounds)",
        "2 teaspoons kosher salt, plus more to taste",
        "1 teaspoon black pepper, plus more to taste",
        " Freshly grated zest of 1 lemon, for serving",
        "@@FOR THE CROUTONS (OPTIONAL):@@",
        "3 cups diced rustic country bread (3/4-inch pieces)"
      ],
      "instructions": [
        "Make the rosemary oil: In a medium skillet, combine the olive oil and rosemary sprigs. Cook over low heat for 5 minutes, lowering the heat if the oil reaches a full simmer. (You want to cook it at a very gentle simmer to avoid frying the rosemary.) Carefully pour the oil and rosemary into a small bowl, leaving a slick of oil in the pan if you plan to make croutons. Allow the rosemary to cool completely in the oil while you make the soup.",
        "Make the soup: In a heavy pot or Dutch oven, heat 2 tablespoons olive oil over medium-low. Add the onion and cook, stirring occasionally, until tender and translucent, 6 to 8 minutes. Add the garlic and cook until fragrant, about 30 seconds. (Be careful not to let the garlic scorch!)",
        "Add the stock, cauliflower, salt and pepper, and bring to a boil over high. Lower the heat, cover, and simmer until the cauliflower is tender when pierced with a fork, about 10 minutes.",
        "Meanwhile, make the optional croutons: Heat the reserved skillet with the residual rosemary oil over medium. Add the bread cubes, sprinkle generously with salt and pepper, and cook, tossing often, until toasted all over, 4 to 5 minutes. Transfer the croutons to a plate or board to cool.",
        "Strain and discard the rosemary stems from the rosemary oil. Working in batches if necessary, carefully transfer the vegetables, stock and 1/4 cup rosemary oil to a <a href='https://www.nytimes.com/wirecutter/reviews/best-blender/'>blender</a> and blend on high until creamy. Add more rosemary oil to taste, and blend to combine. Return the soup to the pot and bring to a simmer. If the soup seems thin, let it simmer for 5 to 10 minutes to reduce slightly. (Remember: The soup will continue to thicken as it cools.) Season to taste with salt and pepper.",
        "Serve hot. Garnish each serving with a swirl of rosemary oil, a few croutons, and a sprinkle of lemon zest. The soup will thicken as it sits; add more stock as necessary when reheating. Leftover rosemary oil will keep in a sealed container at room temperature for up to 1 week."
      ],
      "country": "Yemen"
    },
    {
      "id": 21,
      "foodname": "Chicken Paprikash",
      "slug": "1018068-chicken-paprikash",
      "image": "https://recipes.eerieemu.com/static/recipes/1018068-chicken-paprikash.jpg",
      "description": "Spices lose their flavor over time but few as quickly as paprika, which starts out tasting of pepper and sunshine but deteriorates in but a few months to sawdust and bitterness. For this recipe, get some new at the market: sweet or hot Hungarian paprika is best, but the generic article isn’t terrible and the smoky Spanish varieties known as pimentón de La Vera would not be out of place either, lending a deep, woodsy aroma reminiscent of cooking over an open fire. It’s a dish that pairs beautifully with butter-slicked egg noodles.",
      "servings": "Serves 4-6",
      "rating_value": 5,
      "ingredients": [
        "3 to 4 pounds chicken thighs and drumsticks, or whole chicken legs",
        " Kosher salt and freshly ground black pepper to taste",
        "1 tablespoon neutral oil, like canola",
        "3 tablespoons unsalted butter",
        "1 large yellow or Spanish onion, peeled and diced",
        "3 cloves garlic, peeled and minced",
        "3 tablespoons Hungarian paprika, sweet or hot, or a combination",
        "3 tablespoons all-purpose flour",
        "1 cup canned crushed tomatoes or 1 large ripe tomato, chopped",
        "1 cup chicken broth, homemade or, if not, low-sodium",
        "1 pound egg noodles",
        "3/4 cup sour cream"
      ],
      "instructions": [
        "Heat oven to 400. Season the chicken aggressively with salt and pepper. Heat the oil and 1 tablespoon of the butter in a large, heavy, oven-safe sauté pan or Dutch oven set over high flame, until the butter is foaming. Sear the chicken in batches, skin-side down, until it is golden and crisp, approximately 5 to 7 minutes. Then turn the chicken over, and repeat on the other side, approximately 5 to 7 minutes. Remove chicken to a plate to rest.",
        "Pour off all but 3 tablespoons of the accumulated fat in the pot. Return the pot to the stove, over medium heat, and add the onion. Cook, stirring frequently with a spoon to scrape off any browned bits of chicken skin, until the onion has softened and gone translucent, approximately 5 minutes. Add the garlic, and stir again, cooking it until it has softened, approximately 3 to 4 minutes. Add the paprika and the flour, and stir well to combine, then cook until the mixture is fragrant and the taste of the flour has been cooked out, approximately 4 to 5 minutes.",
        "Add tomatoes and broth, whisk until smooth and then nestle the chicken back in the pan, skin-side up. Slide the pan or pot into the oven, and cook until the chicken has cooked through and the sauce has thickened slightly, approximately 25 to 30 minutes.",
        "Meanwhile, set a large pot of heavily salted water to boil over high heat. Cook noodles in the water until they are almost completely tender, approximately 7 to 8 minutes. Drain the noodles, and toss them in a bowl with the remaining butter, then toss again to coat.",
        "Place the chicken on top of the noodles, then add the sour cream to the sauce, stir to combine and ladle it over the whole."
      ],
      "country": "Malaysia"
    },
    {
      "id": 22,
      "foodname": "Butter Chicken",
      "slug": "1016754-butter-chicken",
      "image": "https://recipes.eerieemu.com/static/recipes/1016754-butter-chicken.jpg",
      "description": "Butter chicken is a great, ever-evolving, cross-continental dish found in Delhi, London, New York, Perth and most points in between. In its purest form, it is yogurt-and-spice-marinated chicken dressed in a velvety red bath comprising butter, onions, ginger and tomatoes scented with garam masala, cumin and turmeric, with a cinnamon tang. This version was adapted from Amandeep Sharma, a young kitchen hand at the restaurant Attica, in Melbourne, Australia, who used to make it for staff meal. It is wildly luxurious. Serve with basmati rice and mango chutney, with papadums or naan if you can find them, with extra rice if you cannot.",
      "servings": "6 servings",
      "rating_value": 5,
      "ingredients": [
        "1 1/2 cups full-fat Greek yogurt",
        "2 tablespoons lemon juice",
        "1 1/2 tablespoons ground turmeric",
        "2 tablespoons garam masala",
        "2 tablespoons ground cumin",
        "3 pounds chicken thighs, on the bone",
        "1/4 pound unsalted butter",
        "4 teaspoons neutral oil, like vegetable or canola oil",
        "2 medium-size yellow onions, peeled and diced",
        "4 cloves garlic, peeled and minced",
        "3 tablespoons fresh ginger, peeled and grated or finely diced",
        "1 tablespoon cumin seeds",
        "1 cinnamon stick",
        "2 medium-size tomatoes, diced",
        "2 red chiles, like Anaheim, or 1 jalapeño pepper, seeded and diced",
        "Kosher salt to taste",
        "2/3 cup chicken stock, low-sodium or homemade",
        "1 1/2 cups cream",
        "1 1/2 teaspoons tomato paste",
        "3 tablespoons ground almonds, or finely chopped almonds",
        "1/2 bunch cilantro leaves, stems removed."
      ],
      "instructions": [
        "Whisk together the yogurt, lemon juice, turmeric, garam masala and cumin in a large bowl. Put the chicken in, and coat with the marinade. Cover, and \nrefrigerate (for up to a day).",
        "In a large pan over medium heat, melt the butter in the oil until it starts to \nfoam. Add the onions, and cook, stirring frequently, until translucent. Add the garlic, ginger and cumin seeds, and cook until the onions start to brown.",
        "Add the cinnamon stick, tomatoes, chiles and salt, and cook until the chiles \nare soft, about 10 minutes.",
        "Add the chicken and marinade to the pan, and cook for 5 minutes, then add the chicken stock. Bring the mixture to a boil, then lower the heat and simmer, uncovered, for approximately 30 minutes.",
        "Stir in the cream and tomato paste, and simmer until the chicken is cooked \nthrough, approximately 10 to 15 minutes.",
        "Add the almonds, cook for an additional 5 minutes and remove from the \nheat. Garnish with the cilantro leaves."
      ],
      "country": "Palau"
    },
    {
      "id": 23,
      "foodname": "Lemony Carrot and Cauliflower Soup",
      "slug": "1015360-lemony-carrot-and-cauliflower-soup",
      "image": "https://recipes.eerieemu.com/static/recipes/1015360-lemony-carrot-and-cauliflower-soup.jpg",
      "description": "The beauty of a soup like this — other than its bone-warming properties — is that you don’t need a recipe. You can pretty much simmer together any combination of vegetables with a little water or broth, purée it, top it with good olive oil and salt, and end up with something good to eat. The addition of miso paste and crushed coriander to the broth, and fresh lemon and cilantro at the end, zips things up without negating the comfort factor.",
      "servings": "4 servings",
      "rating_value": 5,
      "ingredients": [
        "1 tablespoon coriander seeds",
        "2 tablespoons extra-virgin olive oil, more for serving",
        "1 large white onion, peeled and diced (2 cups)",
        "2 large garlic cloves, finely chopped",
        "5 medium carrots (1 pound), peeled and cut into 1/2-inch pieces (2 cups)",
        "1 1/2 teaspoons kosher salt, more as needed",
        "3 tablespoons white miso",
        "1 small (or half of a large) head cauliflower, trimmed and cut into florets",
        "1/2 teaspoon lemon zest",
        "2 tablespoons lemon juice, more to taste",
        " Smoky chile powder, for serving",
        " Coarse sea salt, for serving",
        " Cilantro leaves, for serving"
      ],
      "instructions": [
        "In a large, dry pot over medium heat, toast coriander seeds until fragrant and dark golden-brown, 2 to 3 minutes. Transfer to a mortar and pestle and coarsely crush.",
        "Return the pot to medium heat. Add the oil and heat until warm. Stir in onion; cook, stirring occasionally, until soft and lightly colored, 7 to 10 minutes. Stir in garlic and cook 1 minute.",
        "Add carrots, crushed coriander, salt and 6 cups water to the pot. Stir in the miso until it dissolves. Bring mixture to a simmer and cook, uncovered, 5 minutes. Stir in cauliflower and cook, covered, over medium-low heat until the vegetables are very tender, about 10 minutes.",
        "Remove the soup from the heat. Using an immersion blender, purée the soup until smooth. (Alternatively, you can let soup cool slightly then purée it in batches in a food processor or blender.) If necessary, return the puréed soup to the heat to warm through. Stir in the lemon zest and juice just before serving. Drizzle with oil and sprinkle with chile, sea salt and cilantro leaves."
      ],
      "country": "Cyprus"
    },
    {
      "id": 24,
      "foodname": "Peanut Butter-Miso Cookies",
      "slug": "1020538-peanut-butter-miso-cookies",
      "image": "https://recipes.eerieemu.com/static/recipes/1020538-peanut-butter-miso-cookies.jpg",
      "description": "These cookies were the result of a happy accident. (The best things always are, aren’t they?) When the peanut butter ran out, similarly creamy white miso stepped in. The other ingredients were tweaked to offset the miso’s savory character, and what came out of the oven was salty and sweet, crunchy and chewy. A brief stint in the fridge helps mellow the miso’s bracing brackishness, and a roll in Demerara sugar adds a subtle crunch that pairs well with the tender cookie.",
      "servings": "About 18 cookies",
      "rating_value": 5,
      "ingredients": [
        "1 3/4 cups/225 grams all-purpose flour",
        "3/4 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 cup/115 grams unsalted butter (1 stick), at room temperature",
        "1 cup/220 grams light brown sugar",
        "1/2 cup/100 grams granulated sugar",
        "1/3 cup/80 milliliters white miso paste",
        "1/4 cup/60 milliliters chunky peanut butter",
        "1 large egg",
        "1 1/2 teaspoons vanilla extract",
        "1/2 cup/105 grams Demerara sugar, plus more as needed"
      ],
      "instructions": [
        "In a medium bowl, combine flour, baking soda and baking powder, and whisk until incorporated. Set aside.",
        "In the bowl of an electric mixer fitted with the paddle attachment, mix butter, light brown sugar and granulated sugar at medium speed until light and fluffy, about 5 minutes.",
        "Add miso and peanut butter to the mixing bowl, and continue to mix at medium speed, about 1 minute. Scrape down sides of the bowl to make sure all of the ingredients are evenly incorporated, and mix a bit more if needed. Add egg and vanilla extract, and mix until just combined.",
        "Add 1/3 of the flour mixture to the mixing bowl, and mix on low speed until flour mixture is incorporated. Repeat with remaining flour mixture in two batches until all of it is incorporated.",
        "Place 1/2 cup Demerara sugar into a small bowl. Working with one piece at a time, scoop out about 2 heaping tablespoons of dough (about 50 grams per cookie), and roll each portion between your hands until it is nice and round. (If the dough is too soft to roll, you can pop the mixing bowl in the refrigerator for 5 to 10 minutes to firm the dough up slightly.) Drop the piece of dough into the bowl of Demerara sugar and turn to coat. Transfer each ball to a parchment-lined baking sheet, arranging them about 3 inches apart. Repeat with all of the dough.",
        "Refrigerate for 2 hours and up to overnight. (Even 15 minutes of refrigerator time will help the dough firm up, and the flavors meld. The longer the dough is refrigerated, the more mellow the flavors will be.)",
        "When ready to bake, heat oven to 350 degrees. Bake cookies for about 15 minutes, until crisp at the edges and slightly puffed in the middle. They should still be a bit underdone in the center. Pull out the baking sheet and hit it against a counter. Place back into the oven to finish for about 3 to 4 minutes. When cookies are firm at the edges and slightly puffed in the center, pull them out and again hit the baking sheet against the counter. The cookies should appear flat and crinkly at the center.",
        "Let the cookies cool on a baking sheet for a few minutes, then transfer to a cooling rack. Store fully cooled cookies in an airtight container; they should retain their chewy texture for a few days."
      ],
      "country": "Burundi"
    },
    {
      "id": 25,
      "foodname": "The $250 Cookie Recipe",
      "slug": "9465-the-250-cookie-recipe",
      "image": "https://recipes.eerieemu.com/static/recipes/9465-the-250-cookie-recipe.jpg",
      "description": "Almost everybody has heard the one about the woman lunching at the Neiman Marcus Cafe in Dallas, who enjoyed the chocolate chip cookies so much that she asked for the recipe. For \"only two-fifty,\" the waitress said, it was hers. But when the credit card bill arrived, the woman found the total near $300. Turns out the recipe cost $250, the story goes. In 1997, after years of enduring the myth, Neiman Marcus came up with a recipe – and gave it out for free. It's a delicious variation on chocolate chip cookies, using ground oatmeal, nuts and adding extra chocolate with a grated Hershey bar (you can use any brand you love).",
      "servings": "About 55 cookies",
      "rating_value": 5,
      "ingredients": [
        "1 cup butter",
        "1 cup dark brown sugar, packed",
        "1 cup granulated sugar",
        "2 eggs",
        "1 teaspoon vanilla",
        "2 1/2 cups oatmeal",
        "2 cups flour",
        "1/2 teaspoon salt",
        "1 teaspoon baking soda",
        "1 teaspoon baking powder",
        "12 ounces chocolate chips",
        "1 4-ounce milk chocolate bar",
        "1 1/2 cups chopped nuts"
      ],
      "instructions": [
        "Heat oven to 375 degrees.",
        "Cream together butter and both sugars. Stir in eggs and vanilla.",
        "Finely grind oatmeal in a blender or food processor. Combine the oatmeal, flour, salt, baking powder and soda in a medium bowl, and slowly add it to the wet ingredients. Beat just until combined. Grate chocolate bar using a microplane grater and add it, along with chocolate chips and nuts to the batter. Mix just to combine.",
        "Drop by heaping tablespoonfuls, 2 inches apart, on a greased cookie sheet. Bake for 10 minutes."
      ],
      "country": "Turkey"
    },
    {
      "id": 26,
      "foodname": "Charlie Bird’s Farro Salad",
      "slug": "1015843-charlie-birds-farro-salad",
      "image": "https://recipes.eerieemu.com/static/recipes/1015843-charlie-birds-farro-salad.jpg",
      "description": "There are two essential steps to a stellar farro salad. The first is cooking the farro with enough salt and aromatics so that it delicious before you combine it with the rest of the ingredients. The second is to use very good olive oil in the dressing. This farro salad, from the restaurant Charlie Bird in SoHo, hits both these marks. The chef Ryan Hardy cooks the farro in apple cider seasoned with bay leaves and plenty of salt, which renders it good enough to eat on its own. But it’s even better after he adds loads of olive oil, plus pistachio nuts and Parmesan cheese to make it even richer. Then, before serving, he folds in fresh vegetables to brighten it up: juicy tomatoes, radishes, arugula and plenty of herbs. There are many farro salads of this ilk out there. This is one of the best.",
      "servings": "6 servings",
      "rating_value": 5,
      "ingredients": [
        "1 cup farro",
        "1 cup apple cider",
        "2 teaspoons kosher salt, more as needed",
        "2 bay leaves",
        "8 tablespoons extra-virgin olive oil",
        "2 tablespoons fresh lemon juice",
        "70 grams Parmesan cheese, shaved with a vegetable peeler (1/2 cup)",
        "70 grams chopped pistachio nuts (1/2 cup)",
        "2 cups arugula leaves",
        "1 cup parsley or basil leaves, torn",
        "1 cup mint leaves",
        "3/4 cup halved cherry or grape tomatoes",
        "1/3 cup thinly sliced radish",
        " Maldon or other flaky sea salt, for finishing"
      ],
      "instructions": [
        "In a medium saucepan, bring farro, apple cider, salt, bay leaves and 2 cups water to a simmer. Simmer until farro is tender and liquid evaporates, about 30 minutes. If all the liquid evaporates before the farro is done, add a little more water. Let farro cool, then discard bay leaves.",
        "In a salad bowl, whisk together olive oil, lemon juice and a pinch of salt. Add farro, cheese and pistachio nuts and mix well. This salad base will keep for up to 4 hours at room temperature or overnight in the refrigerator (bring to room temperature before serving). Just before serving, fold in arugula, herbs, tomatoes, radish and flaky salt to taste."
      ],
      "country": "Christmas Island"
    },
    {
      "id": 27,
      "foodname": "Lemony Turmeric Tea Cake",
      "slug": "1020637-lemony-turmeric-tea-cake",
      "image": "https://recipes.eerieemu.com/static/recipes/1020637-lemony-turmeric-tea-cake.jpg",
      "description": "This cake, which is adapted from “Nothing Fancy: Unfussy Food for Having People Over,” is so good and so simple to put together, you might come to call it “house cake,” which is, of course, cake to keep in your house at all times. Just slicing into it makes a bad day better, the baked equivalent of burning sage or palo santo to clear the energy. It travels well, and can truly be brought anywhere for any occasion, but most of the time it won’t make it out of your kitchen.",
      "servings": "One 9-inch loaf",
      "rating_value": 5,
      "ingredients": [
        " Nonstick cooking spray or butter, for greasing the pan",
        "1 1/2 cups/215 grams all-purpose flour",
        "2 teaspoons baking powder",
        "1 teaspoon kosher salt",
        "3/4 teaspoon ground turmeric",
        "2 lemons",
        "1 cup/200 grams granulated sugar, plus 2 tablespoons for sprinkling",
        "3/4 cup/180 milliliters sour cream or full-fat Greek yogurt, plus more for serving (optional)",
        "2 large eggs",
        "1/2 cup/115 grams unsalted butter (1 stick), melted",
        " Whipped cream (optional)"
      ],
      "instructions": [
        "Heat the oven to 350 degrees. Lightly grease a 4-by-9-inch loaf pan (see Tip) with nonstick cooking spray or butter, and line it with parchment, leaving some overhang on both of the longer sides so you’re able to easily lift the cake out after baking.",
        "Whisk the flour, baking powder, salt and turmeric in a large bowl.",
        "Grate 2 tablespoons zest from 1 lemon into a medium bowl. Halve the zested lemon and squeeze 2 tablespoons juice into a small bowl. Cut half the remaining whole lemon into thin rounds, discarding seeds (save the other half for another use).",
        "Add 1 cup sugar to the lemon zest in the medium bowl; rub together with your fingertips until the sugar is fragrant and tinted yellow. Whisk in the sour cream, eggs and the 2 tablespoons lemon juice until well blended.",
        "Using a spatula, add the wet mixture to the flour mixture, stirring just to blend. Fold in the melted butter. Scrape the batter into the prepared pan, smoothing the top. Scatter the top with the lemon slices and 2 tablespoons sugar.",
        "Bake until the top of the cake is golden brown, the edges pull away from the sides of the pan, and a tester inserted into the center comes out clean, 50 to 60 minutes. (If the lemons are getting too dark, lay a piece of foil on top to prevent burning.) Let cool before slicing. (Cake can be baked up to 5 days ahead, wrapped tightly, and stored at room temperature.) Serve with whipped cream, if desired."
      ],
      "country": "Georgia"
    },
    {
      "id": 28,
      "foodname": "Creamy White Beans With Herb Oil",
      "slug": "1019385-creamy-white-beans-with-herb-oil",
      "image": "https://recipes.eerieemu.com/static/recipes/1019385-creamy-white-beans-with-herb-oil.jpg",
      "description": "Canned beans are transformed into a hearty, elegant main swirled with an herb oil that comes together in no time with the aid of a food processor. This particular oil includes chives, cilantro and basil, but feel free to use what you have on hand. Parsley and mint would also work well. Serve with a chilled glass of red wine, a big green salad and a loaf of crusty bread.",
      "servings": "2 to 4 servings",
      "rating_value": 5,
      "ingredients": [
        "@@FOR THE HERB OIL:@@",
        "1/2 cup roughly chopped chives",
        "1/2 cup roughly chopped cilantro leaves and tender stems",
        "1/2 cup tightly packed basil leaves",
        "1/2 cup olive oil",
        " Squeeze of lemon",
        " Kosher salt, to taste",
        "@@FOR THE BEANS:@@",
        "2 tablespoons olive oil",
        "2 garlic cloves, thinly sliced",
        "2 (15-ounce) cans white beans, like butter beans or cannellini, rinsed and drained",
        " Kosher salt and black pepper",
        "1/2 cup chicken stock, vegetable stock or water",
        " Flaky salt, for serving (optional)"
      ],
      "instructions": [
        "Make the oil: In a food processor, combine chives, cilantro and basil, and pulse until finely chopped. Add olive oil, and pulse again until mixture is silky and emulsified. Transfer to a small bowl, stir in lemon juice and salt to taste. Set aside.",
        "Prepare the beans: In a 10-inch skillet, heat olive oil over medium-low heat. Add garlic and cook until translucent, about 1 minute. Add beans to the skillet and season with salt and pepper. Cook, stirring occasionally, until the flavors have melded, about 2 to 3 minutes. With the back of a spoon or spatula, smash about 1/3 to 1/2 cup of the beans and stir until they are incorporated into the rest of the bean mixture. A good portion of the remaining beans should maintain their structure.",
        "Add stock or water and bring to a gentle simmer. Cook until sauce becomes creamy and is reduced by about about half, about 1 to 2 minutes more. Smash additional beans and add a few more tablespoons of water, if needed, to reach desired consistency and stir again to combined.",
        "Transfer beans to a bowl and swirl with herb oil on top. Season with flaky salt, if desired."
      ],
      "country": "Montserrat"
    },
    {
      "id": 29,
      "foodname": "Carrot Cake",
      "slug": "1015523-carrot-cake",
      "image": "https://recipes.eerieemu.com/static/recipes/1015523-carrot-cake.jpg",
      "description": "You've got enough frosting to fill the layers and cover the sides and top of the cake, but Dorie Greenspan covers each layer generously, so generously that when the next layer goes on the frosting ripples out around the edges. Then just swirl the frosting over the top, leaving the sides bare.",
      "servings": "8 to 12 servings",
      "rating_value": 5,
      "ingredients": [
        "@@FOR THE CAKE:@@",
        "2 cups all-purpose flour",
        "2 teaspoons baking powder",
        "2 teaspoons baking soda",
        "2 teaspoons ground cinnamon",
        "3/4 teaspoon salt",
        "3 cups grated carrots (you can grate the carrots in a food processor fitted with a shredding blade)",
        "1 cup coarsely chopped walnuts or pecans",
        "1 cup shredded coconut, sweetened or unsweetened",
        "1/2 cup moist, plump raisins (dark or golden) or dried cranberries",
        "2 cups sugar",
        "1 cup canola or safflower oil",
        "4 large eggs",
        "@@FOR THE FROSTING:@@",
        "8 ounces cream cheese, at room temperature",
        "1 stick (8 tablespoons) unsalted butter, at room temperature",
        "1 pound (3 3/4 cups) confectioners' sugar",
        "1 tablespoon fresh lemon juice or 1/2 teaspoon pure lemon extract",
        "1/2 cup shredded coconut, optional",
        " Toasted finely chopped nuts and/or toasted coconut, for topping, optional"
      ],
      "instructions": [
        "For the cake: Position the racks to divide the oven into thirds and preheat the oven to 325 degrees. Butter and flour three 9-inch round, 2-inch deep <a href='https://www.nytimes.com/wirecutter/reviews/best-cake-pans/'>cake pans</a>, flour the insides and tap out the excess.",
        "Whisk together the flour, cinnamon, baking powder, baking soda and salt and set aside. In another bowl, stir together the carrots, chopped nuts, coconut and raisins.",
        "Working in a mixer fitted with the paddle attachment, or in a large bowl with a whisk, beat the sugar and oil together until smooth. Add the eggs one by one and continue to beat until the batter is even smoother. If you are working in a mixer, reduce the speed to low, if you're working by hand switch to a large rubber spatula, and gently stir in the flour mixture — mix only until the dry ingredients disappear. Just as gently, stir in the chunky ingredients.",
        "Divide the batter among the baking pans and slide the pans into the oven. Bake the cakes for 40 to 50 minutes, rotating the pans top to bottom and front to back at the midway point. The cakes are properly baked when a knife inserted into the centers of the cakes comes out clean; the cakes will just start to come away from the edges. Transfer the pans to cooling racks, cool for 5 minutes, then turn out onto racks to cool to room temperature. (At this point, the cakes can be wrapped airtight and kept at room temperature overnight or frozen for up to 2 months; thaw before frosting.)",
        "For the frosting: Working in a mixer fitted with the paddle attachment, beat the cream cheese and butter together until smooth and creamy. Gradually add the confectioners' sugar and continue to beat until the frosting is velvety smooth. Beat in the lemon juice or extract.",
        "If you'd like to have coconut in the filling, scoop out about 1/2 of the frosting and stir the coconut into this portion.",
        "To frost the cake, place one layer of the cake, right-side up, on a cardboard round or a cake plate. If you've added coconut to the frosting, use half of coconut frosting to generously cover the first layer. Use an offset spatula or a spoon to smooth the frosting all the way to the edges of the layer. Top with the second layer, this time placing the cake top-side down. Frost with the remainder of the coconut frosting. Top with the last layer, right-side up and use the plain frosting to cover the top — and the sides, if you want – of the cake. Finish the top layer with swirls of frosting. If you want to top the cake with toasted nuts or coconut, sprinkle on these ingredients now, while the frosting is soft. Slide the cake into the refrigerator for 15 minutes, just to set the frosting.",
        "Serving: The cake can be served as soon as the frosting is set. It can also wait, at room temperature and covered with a cake keeper, overnight. The cake is best served in thick slices at room temperature and, while it's good plain, it's better with whipped cream, vanilla ice cream or even some lemon curd with a little whipped cream folded in.",
        "Storing: Covered the cake will keep at room temperature for 2 to 3 days. It can also be frozen, uncovered, and then, when it is firmed, wrapped airtight and kept in the freezer for up to 2 months; defrost, still wrapped, in the refrigerator overnight."
      ],
      "country": "Holy See (Vatican City State)"
    },
    {
      "id": 30,
      "foodname": "Lemon Bars With Olive Oil and Sea Salt",
      "slug": "1017141-lemon-bars-with-olive-oil-and-sea-salt",
      "image": "https://recipes.eerieemu.com/static/recipes/1017141-lemon-bars-with-olive-oil-and-sea-salt.jpg",
      "description": "Traditional lemon bars balance the tangy sweetness of lemon curd with a rich shortbread crust. This recipe adds extra notes of flavor to the mix: the compelling bitterness of good olive oil and a touch of sea salt sprinkled on top. They lend a mild savory character to this childhood favorite, making it a little more sophisticated than the usual lemon bar, but just as compelling. Choose an olive oil with personality, otherwise you’ll miss the point. Something herbal and fresh tasting with peppery notes works best. Although the bars will last up to five days when stored in the fridge, they have the brightest flavor when eaten within 24 hours of baking.",
      "servings": "24 bars",
      "rating_value": 5,
      "ingredients": [
        "@@FOR THE CRUST:@@",
        "1 1/4 cups/155 grams all-purpose flour",
        "1/4 cup/50 grams granulated sugar",
        "3 tablespoons/25 grams confectioners’ sugar",
        "1 teaspoon finely grated lemon zest",
        "1/4 teaspoon fine sea salt",
        "10 tablespoons/142 grams cold unsalted butter, cut into cubes",
        "@@FOR THE CURD:@@",
        "4 to 6 lemons",
        "1 1/2 cups/300 grams sugar",
        "2 large eggs plus 3 yolks",
        "1 1/2 teaspoons/5 grams cornstarch",
        " Pinch of fine sea salt",
        "4 tablespoons/57 grams butter",
        "1/4 cup/60 milliliters fruity extra-virgin olive oil",
        " Confectioners’ sugar and flaky sea salt, for sprinkling"
      ],
      "instructions": [
        "Heat oven to 325 degrees and line a 9-by-9-inch baking pan with enough parchment to hang over two of the sides (to be used as handles later to lift the bars out of the pan).",
        "To make the shortbread base, pulse together the flour, granulated sugar, confectioners’ sugar, lemon zest and salt in a food processor, or whisk together in a large bowl. Add butter and pulse (or use two knives or your fingers) to cut the butter into the flour until a crumbly dough forms. Press dough into prepared pan and bake until shortbread is pale golden all over, 30 to 35 minutes.",
        "While the shortbread is baking, prepare the lemon curd: Grate 1/2 tablespoon zest from lemons and set aside. Squeeze lemons to yield 3/4 cup juice.",
        "In a small saucepan, whisk together lemon juice, sugar, eggs and yolks, cornstarch and fine sea salt over medium heat until boiling and thickened, 2 to 5 minutes. Make sure mixture comes to a boil and stays there for 30 seconds or so; you should see it thicken up before you take it off the heat. But once it boils do not cook for longer than 1 minute or you risk the curd thinning out again. Remove from heat and strain into a bowl. Whisk in butter, olive oil and lemon zest.",
        "When the shortbread is ready, take it out of the oven and carefully pour the lemon curd onto the shortbread base; return the pan to the oven. Bake until topping is just set, 10 to 15 minutes more. Allow to cool to room temperature, then refrigerate until cold before cutting into bars. Sprinkle with confectioners’ sugar and flaky sea salt right before serving."
      ],
      "country": "Libyan Arab Jamahiriya"
    },
    {
      "id": 31,
      "foodname": "Lemon-Garlic Kale Salad",
      "slug": "1015411-lemon-garlic-kale-salad",
      "image": "https://recipes.eerieemu.com/static/recipes/1015411-lemon-garlic-kale-salad.jpg",
      "description": "Here's a snappy, fresh side dish or a light supper: a lemony green salad, rich with tang and crunch. The dressing is nothing more than lemon juice, olive oil, garlic and salt. Its simplicity makes it perfect.",
      "servings": "8 to 12 servings",
      "rating_value": 5,
      "ingredients": [
        "2 cups sliced almonds",
        "1/3 cup freshly squeezed lemon juice (from 2 to 4 lemons)",
        "Kosher salt",
        "1 1/2 cups extra-virgin olive oil",
        "4 cloves garlic, crushed with the flat side of a knife, peeled and left whole",
        "10 to 12 ounces washed and dried kale leaves, thick stems removed (weight after trimming)",
        "1 1/2 cups freshly grated Parmesan (optional)"
      ],
      "instructions": [
        "In a toaster oven or skillet, toast almonds until golden brown and fragrant. Set aside to cool.",
        "In a <a href='https://www.nytimes.com/wirecutter/reviews/best-mixing-bowls/'>bowl</a>, combine lemon juice and 1 heaping teaspoon salt. Slowly whisk in olive oil. Add garlic cloves and set aside to steep.",
        "Working in batches, cut the kale into thin ribbons: gather a large handful of leaves, bunch together tightly, and use the other hand to slice into 1/4-inch-thick pieces. This need not be done very precisely or neatly; the idea is to end up with a kind of slaw. (Recipe can be made up to this point 1 day ahead. Keep kale and dressing refrigerated separately.)",
        "Place chopped kale in a very large bowl. Sprinkle surface with almonds and then with cheese, if using. Remove and discard garlic cloves from dressing. Pour half the dressing over the salad and toss. Taste for dressing and salt and add more as needed, tossing to coat thoroughly. Serve within 1 hour."
      ],
      "country": "Trinidad and Tobago"
    },
    {
      "id": 32,
      "foodname": "Sheet-Pan Chicken With Chickpeas, Cumin and Turmeric",
      "slug": "1018910-sheet-pan-chicken-with-chickpeas-cumin-and-turmeric",
      "image": "https://recipes.eerieemu.com/static/recipes/1018910-sheet-pan-chicken-with-chickpeas-cumin-and-turmeric.jpg",
      "description": "The yogurt marinade does two very important jobs in this sheet-pan chicken recipe. One, the acidity in the marinade helps tenderize the meat, and two, the sugars in the yogurt help brown and caramelize the skin of the chicken as it roasts. Be sure to toss the chickpeas occasionally as they roast to encourage them to get coated in the chicken fat as it renders.",
      "servings": "4 servings",
      "rating_value": 5,
      "ingredients": [
        "1 (3 1/2 to 4 pound) chicken, cut into parts (alternatively, 3 to 3 1/2 pounds of bone-in, skin-on chicken parts, such as breasts, thighs and legs)",
        " Kosher salt and freshly ground pepper",
        "1 1/2 cups full-fat Greek yogurt, divided",
        "5 tablespoons fresh lemon juice, divided",
        "2 teaspoons ground turmeric, divided",
        "2 (15-ounce) cans chickpeas, drained and rinsed",
        "1 tablespoon fennel seed",
        "1 teaspoon ground cumin",
        "1 large red onion, thinly sliced, divided",
        "2 tablespoons olive oil",
        "1/2 cup mint or cilantro leaves, torn"
      ],
      "instructions": [
        "Season chicken parts with salt and pepper.",
        "Combine 3/4 cup yogurt, 2 tablespoons lemon juice, 1 teaspoon turmeric and 2 tablespoons water in a large bowl. Season well with salt and pepper. (It should be on the salty side, as this is a marinade.) Add chicken and toss to coat evenly. Let sit at least 30 minutes at room temperature, and up to overnight in the refrigerator.",
        "Place oven rack on the top third of the oven and heat to 425 degrees.",
        "Combine chickpeas, fennel seed, cumin, remaining teaspoon of turmeric and half the red onion slices on a rimmed baking sheet. Drizzle with olive oil, season with salt and pepper and toss to coat.",
        "Move chickpeas to the outer edges of the baking sheet. Scrape any excess marinade off the chicken, and place the chicken parts in the center. Place baking sheet in oven and bake, tossing chickpeas occasionally, until the skin of the chicken is evenly browned and the chickpeas are golden and starting to crisp, 45 to 50 minutes.",
        "Meanwhile, toss remaining onion slices with 2 tablespoons lemon juice and season with salt and pepper; set aside.",
        "Combine remaining yogurt with remaining 1 tablespoon lemon juice and season with salt and pepper; set aside.",
        "Once chicken is ready, scatter with lemony onions and mint or cilantro. Serve with seasoned yogurt alongside as a sauce."
      ],
      "country": "Marshall Islands"
    },
    {
      "recipe": "",
      "description": "resh raw corn shucked from the cob is ideal here. The juice from the tomatoes delivers just the right amount of acidity, so there’s no need for vinegar. Eat this as is, by the bowl, or toss it with cooked rice or beans for a more filling meal — you’ll want to add oil and vinegar accordingly. In midsummer, with peak-season produce, there is nothing better.",
      "ingredients": [
        " to 3 cups raw or cooked corn kernels (from 4 to 6 ears)"
      ],
      "country": "Kanairo",
      "people": "",
      "rating": "8",
      "procedure": "",
      "images": "",
      "image": "https://recipes.eerieemu.com/static/recipes/1015537-corn-salad-with-tomatoes-feta-and-mint.jpg",
      "foodname": "Corn Salad With Tomatoes, Feta and Mint",
      "instructions": "Put the corn, tomatoes, cheese and mint in a medium bowl. Drizzle with the olive oil and toss to coat.",
      "servings": "4",
      "id": 33
    },
    {
      "foodname": "Corn Salad With Tomatoes, Feta and Mint",
      "description": "Corn Salad With Tomatoes, Feta and Mint",
      "ingredients": "Corn Salad With Tomatoes, Feta and Mint",
      "country": "Kanairo",
      "servings": "5",
      "rating": "7",
      "instructions": "Corn Salad With Tomatoes, Feta and Mint",
      "image": "https://recipes.eerieemu.com/static/recipes/1019451-spicy-corn-and-coconut-soup.jpg",
      "id": 35
    },
    {
      "foodname": "Corn Salad With Tomatoes, Feta and Mint",
      "description": "Corn Salad With Tomatoes, Feta and Mint",
      "ingredients": "Corn Salad With Tomatoes, Feta and Mint,Corn Salad With Tomatoes, Feta and MintCorn Salad With Tomatoes, Feta and MintCorn Salad With Tomatoes, Feta and Mint",
      "country": "canairo",
      "servings": "5",
      "rating": "8",
      "instructions": "Corn Salad With Tomatoes, Feta and Mint\n\nCorn Salad With Tomatoes, Feta and Mint\nCorn Salad With Tomatoes, Feta and Mint\nCorn Salad With Tomatoes, Feta and Mint\nCorn Salad With Tomatoes, Feta and Mint\nCorn Salad With Tomatoes, Feta and Mint\nCorn Salad With Tomatoes, Feta and Mint\nCorn Salad With Tomatoes, Feta and Mint",
      "image": "https://recipes.eerieemu.com/static/recipes/1020993-tofu-and-green-beans-with-chile-crisp.jpg",
      "id": 36
    }
  ]
}